Janechel/test1/C/STM32F103C8T6/PrimaryMemoryTable/Example/User/main.c
    ret = primary_servo_read_present_position_and_present_current_analysis(receive_data, &position, &current);
    if(ret == SUCCESS)
		{
			PRINTF("present position is %d, present current is %d\r\n", position, current);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the present velocity of servo ID1.
    primary_servo_read_present_velocity(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
		receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_present_velocity_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("present velocity is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the present profile position of servo ID1.
    primary_servo_read_present_profile_position(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
		receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_present_profile_position_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("present profile position is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the present profile velocity of servo ID1.
    primary_servo_read_present_profile_velocity(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
		receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_present_profile_velocity_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("present profile velocity is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the present PWM of servo ID1.
    primary_servo_read_present_pwm(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
		receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_present_pwm_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("present pwm analysis is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the present temperature of servo ID1.
    primary_servo_read_present_temperature(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
		receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_present_temperature_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("present temperature is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the present voltage of servo ID1.
    primary_servo_read_present_voltage(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_present_voltage_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("present voltage is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the time base target moving time of servo ID1.
    primary_servo_read_time_base_target_moving_time(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_time_base_target_moving_time_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("present time base target moving time is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the time base target position of servo ID1.
    primary_servo_read_time_base_target_position(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_time_base_target_position_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("present time base target position is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif

#if READ_TEST
		//Read the time base target ACC of servo ID1.
    primary_servo_read_time_base_target_acc(1, order_buffer,&order_len);   
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_time_base_target_acc_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("present time base target acc is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif
		
#if READ_TEST
    //Read the time base target position and moving time of servo ID1.
    primary_servo_read(1, 0x3C, 4, order_buffer, &order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

		PRINTF("the time base target position and moving time pack is: ");
		for (uint8_t i = 0; i < receive_len; i++)
		{
				PRINTF("0x%02x ", receive_data[i]);
		}
		PRINTF("\r\n");
		
		Delay(1000);
#endif

#if READ_TEST
    //Read the time base target ACC, position and moving time of servo ID1.
    primary_servo_read(1, 0x3B, 5, order_buffer, &order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

		PRINTF("the time base target acc, position and moving time pack is: ");
		for (uint8_t i = 0; i < receive_len; i++)
		{
				PRINTF("0x%02x ", receive_data[i]);
		}
		PRINTF("\r\n");
		
		Delay(1000);
#endif

#if READ_TEST
		//Read the velocity base target DEC of servo ID1.
    primary_servo_read_velocity_base_target_dec(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);
		
