Janechel/test1/C/STM32F103C8T6/PrimaryMemoryTable/Example/User/main.c
    ret = primary_servo_read_velocity_base_target_dec_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("present velocity base target dec is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the velocity base target ACC of servo ID1.
    primary_servo_read_velocity_base_target_acc(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_velocity_base_target_acc_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("present velocity base target acc is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the velocity base target velocity of servo ID1.
    primary_servo_read_velocity_base_target_velocity(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_velocity_base_target_velocity_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("present velocity base target velocity is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the velocity base target position of servo ID1.
    primary_servo_read_velocity_base_target_position(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_velocity_base_target_position_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("present velocity base target position is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif
		
#if READ_TEST
    //Read the velocity base target position and velocity of servo ID1.
    primary_servo_read(1, 0x35, 4, order_buffer, &order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    PRINTF("the velocity base target position and velocity pack is: ");
		for (uint8_t i = 0; i < receive_len; i++)
		{
				PRINTF("0x%02x ", receive_data[i]);
		}
		PRINTF("\r\n");
		
		Delay(1000);
#endif

#if READ_TEST
    //Read the velocity base target position, velocity, ACC, and DEC of servo ID1.
    primary_servo_read(1, 0x35, 6, order_buffer, &order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    PRINTF("the velocity base target position,velocity,acc and dec pack is: ");
		for (uint8_t i = 0; i < receive_len; i++)
		{
				PRINTF("0x%02x ", receive_data[i]);
		}
		PRINTF("\r\n");
		
		Delay(1000);
#endif

#if READ_TEST
		//Read the target current of servo ID1.
    primary_servo_read_target_current(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_target_current_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("target current is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the target PWM of servo ID1.
    primary_servo_read_target_pwm(1, order_buffer,&order_len);  
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_target_pwm_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("target pwm is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the torque switch of servo ID1.
    primary_servo_read_torque_switch(1, order_buffer,&order_len);  
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_torque_switch_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("torque switch is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the LED switch of servo ID1.
    primary_servo_read_led_switch(1, order_buffer,&order_len);   
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_led_switch_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("led switch is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif

#if READ_TEST
		//Read the Flash switch of servo ID1.
    primary_servo_read_flash_switch(1, order_buffer,&order_len); 
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_flash_switch_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("flash switch is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif

#if READ_TEST
		//Read the calibration of servo ID1.
    primary_servo_read_calibration(1, order_buffer,&order_len);  
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_calibration_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("calibration is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the control mode of servo ID1.
    primary_servo_read_control_mode(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_control_mode_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("control mode is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the shutdown condition of servo ID1.
    primary_servo_read_shutdown_condition(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_shutdown_condition_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("shutdown condition is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the LED condition of servo ID1.
    primary_servo_read_led_condition(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

