Janechel/test1/C/STM32F103C8T6/PrimaryMemoryTable/Example/User/main.c
    ret = primary_servo_read_led_condition_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("led condition is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the position control D gain of servo ID1.
    primary_servo_read_position_control_d_gain(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_position_control_d_gain_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("position control d gain is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the position control I gain of servo ID1.
    primary_servo_read_position_control_i_gain(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_position_control_i_gain_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("position control i gain is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the position control P gain of servo ID1.
    primary_servo_read_position_control_p_gain(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_position_control_p_gain_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("position control p gain is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif
			
#if READ_TEST
    //Read the position control PID gain of servo ID1.
    primary_servo_read(1, 0x1B, 6, order_buffer, &order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    PRINTF("position control pid gain pack is: ");
		for (uint8_t i = 0; i < receive_len; i++)
		{
				PRINTF("0x%02x ", receive_data[i]);
		}
		PRINTF("\r\n");
		
		Delay(1000);
#endif

#if READ_TEST
		//Read the PWM punch of servo ID1.
    primary_servo_read_pwm_punch(1, order_buffer,&order_len); 
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_pwm_punch_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("pwm punch is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the ccw deadband of servo ID1.
    primary_servo_read_ccw_deadband(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_ccw_deadband_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("ccw deadband is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the cw deadband of servo ID1.
    primary_servo_read_cw_deadband(1, order_buffer,&order_len); 
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_cw_deadband_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("cw deadband is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的电流保护时间
    primary_servo_read_current_shutdown_time(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_current_shutdown_time_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("current shutdown time is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the max current limit of servo ID1.
    primary_servo_read_max_current_limit(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_max_current_limit_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("max current limit is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the max PWM limit of servo ID1.
    primary_servo_read_max_pwm_limit(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_max_pwm_limit_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("max pwm limit is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the max voltage limit of servo ID1.
    primary_servo_read_max_voltage_limit(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_max_voltage_limit_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("max voltage limit is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the min voltage limit of servo ID1.
    primary_servo_read_min_voltage_limit(1, order_buffer,&order_len);   
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

