Janechel/test1/C/STM32F103C8T6/PrimaryMemoryTable/Example/User/main.c
    ret = primary_servo_read_min_voltage_limit_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("min voltage limit is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif
		
#if READ_TEST
    //Read the voltage limit of servo ID1.
    primary_servo_read(1, 0x10, 2, order_buffer, &order_len); 
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    PRINTF("the voltage limit pack is: ");
		for (uint8_t i = 0; i < receive_len; i++)
		{
				PRINTF("0x%02x ", receive_data[i]);
		}
		PRINTF("\r\n");
		
		Delay(1000);
#endif


#if READ_TEST
		//读取ID1舵机的温度上限
    primary_servo_read_max_temperature_limit(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);
		
    ret = primary_servo_read_max_temperature_limit_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("max temperature limit is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif

#if READ_TEST
		//Read the max angle limit of servo ID1.
    primary_servo_read_max_angle_limit(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_max_angle_limit_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("max angle limit is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the min angle limit of servo ID1.
    primary_servo_read_min_angle_limit(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_min_angle_limit_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("min angle limit is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif
		
#if READ_TEST
    //Read the angle limit of servo ID1.
    primary_servo_read(1, 0x0B, 4, order_buffer, &order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    PRINTF("the angle limit pack is: ");
		for (uint8_t i = 0; i < receive_len; i++)
		{
				PRINTF("0x%02x ", receive_data[i]);
		}
		PRINTF("\r\n");
		
		Delay(1000);
#endif

#if READ_TEST
		//Read the return level of servo ID1.
    primary_servo_read_return_level(1, order_buffer,&order_len); 
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_return_level_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("return level is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the return delay time of servo ID1.
    primary_servo_read_return_delay_time(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_return_delay_time_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("return delay time is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the baud rate of servo ID1.
    primary_servo_read_baud_rate(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_baud_rate_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("baud rate is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the model information of servo ID1.
    primary_servo_read_model_information(1, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_model_information_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("model information is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif


#if READ_TEST
		//Read the firmware version of servo ID1.
    primary_servo_read_firmware_version(1, order_buffer,&order_len); 
    USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_read_firmware_version_analysis(receive_data, &analysis_data);
		if(ret == SUCCESS)
		{
			PRINTF("firmware version is %d\r\n",analysis_data);
		}
		
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
		//Change the torque switch of the servo ID1, ID2 to OFF respectively.
		servo.torque_switch[0] = 0;
		servo.torque_switch[1] = 0;
		primary_servo_sync_write_torque_switch(servo, order_buffer, &order_len);
    USART1_Send(order_buffer, order_len);
		PRINTF("sync write torque switch!\r\n");
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
    //Change the control mode of the servo ID1, ID2 to velocity base position control mode respectively.
    servo.control_mode[0] = 1;
    servo.control_mode[1] = 1;
    primary_servo_sync_write_control_mode(servo, order_buffer, &order_len);
    USART1_Send(order_buffer, order_len);
		PRINTF("sync write control mode!\r\n");
		Delay(1000);
#endif

	
#if SYNC_WRITE_TEST
		//Change the velocity base target velocity of the servo ID1, ID2 to 360°/s² and 720°/s², respectively.
    servo.velocity[0] = 3600;
    servo.velocity[1] = 7200;
		
		primary_servo_sync_write_velocity_base_target_velocity(servo, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);
		PRINTF("sync write velocity base target velocity!\r\n");
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
		//Change the velocity base target ACC of servo ID1, ID2 to 500°/s² and 50°/s², respectively.
    servo.acc_velocity[0] = 10;          
    servo.acc_velocity[1] = 1;    
		
		primary_servo_sync_write_velocity_base_target_acc(servo, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);
		PRINTF("sync write velocity base target acc!\r\n");
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
		//Change the velocity base target DEC of servo ID1, ID2 to 50°/s² and 500°/s², respectively.
    servo.dec_velocity[0] = 1;           
    servo.dec_velocity[1] = 10;   
		
