Janechel/test1/C/STM32F103C8T6/PrimaryMemoryTable/Example/User/main.c
		primary_servo_sync_write_velocity_base_target_dec(servo, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);
		PRINTF("sync write velocity base target dec!\r\n");
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
		//Change the velocity base target velocity of the servo ID1, ID2 to 0° midpoint and 0° position, respectively.
    servo.position[0] = 0;
    servo.position[1] = 0;
		
		primary_servo_sync_write_velocity_base_target_position(servo, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);
		PRINTF("sync write velocity base target position!\r\n");
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
		//Change the velocity base target velocity of servo ID1 ,ID2 to 1800 and 3600, and the position to 3000 and 3000, respectively
    servo.velocity[0] = 1800;
    servo.velocity[1] = 3600;
    servo.position[0] = 3000;
    servo.position[1] = 3000;
		
		primary_servo_sync_write_velocity_base_target_position_and_velocity(servo, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);
		PRINTF("sync write velocity base target position and velocity!\r\n");
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
    //SChange the velocity base target velocity of servo ID1 ,ID2 to 3600 and 3600, position to 0,0, acceleration to 100, 100, deceleration to 100, 100, respectively
    servo.velocity[0] = 3600;
    servo.velocity[1] = 3600;
    servo.position[0] = 0;
    servo.position[1] = 0;
    servo.acc_velocity[0] = 100;
    servo.acc_velocity[1] = 100;
    servo.dec_velocity[0] = 100;
    servo.dec_velocity[1] = 100;

		primary_servo_sync_write_velocity_base_target_acc_dec_velocity_and_position(servo, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);
		PRINTF("sync write velocity base target acc dec velocity and position!\r\n");
		Delay(1000);

#endif

#if SYNC_WRITE_TEST
    //Change the torque switch of the servo ID1, ID2 to OFF respectively.
    servo.torque_switch[0] = 0;
    servo.torque_switch[1] = 0;
		primary_servo_sync_write_torque_switch(servo, order_buffer, &order_len);
    USART1_Send(order_buffer, order_len);
		PRINTF("sync write torque switch!\r\n");
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
    //Change the control mode of the servo ID1, ID2 to time base position control mode respectively.
    servo.control_mode[0] = 0;
    servo.control_mode[1] = 0;
    primary_servo_sync_write_control_mode(servo, order_buffer, &order_len);
    USART1_Send(order_buffer, order_len);
		PRINTF("sync write control mode!\r\n");
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
		//Change the time base target ACC of servo ID1 to 1 and 5 respectively.
    servo.acc_velocity_grade[0] = 1;
    servo.acc_velocity_grade[1] = 5;
		
    primary_servo_sync_write_time_base_target_acc(servo, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);
		PRINTF("sync write time base target acc!\r\n");
		Delay(1000);
#endif

#if SYNC_WRITE_TEST
		//Change the time base target position and moving time of servo ID1 to 150° midpoint and 1s, 0° and 500ms respectively.
    servo.position[0] = 1500;
    servo.position[1] = 0;
    servo.time[0] = 1000;
    servo.time[1] = 500;
		
		primary_servo_sync_write_time_base_target_position_and_moving_time(servo, order_buffer,&order_len);
    USART1_Send(order_buffer, order_len);
		PRINTF("sync write time base target position and moving time!\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
		//Change the return level of servo ID1 to respond to all instruction.
    primary_servo_set_return_level(1, 2, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_set_return_level_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("set return level successful.\r\n\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the return delay time of servo ID1 to 500us.
		primary_servo_set_return_delay_time(1, 250,order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_set_return_delay_time_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("set return delay time successful.\r\n\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the baud rate of servo ID1 to 1000000.
    primary_servo_set_baud_rate(1, 7, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_set_baud_rate_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("set baud rate successful.\r\n\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the min angle limit of servo ID1 to 0°.
    primary_servo_set_min_angle_limit(1, 0, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_set_min_angle_limit_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("set min angle limit successful.\r\n\r\n");
		Delay(1000);
#endif

#if WRITE_TEST
    //Change the max angle limit of servo ID1 to 300°.
    primary_servo_set_max_angle_limit(1, 3000, order_buffer,&order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    ret = primary_servo_set_max_angle_limit_analysis(receive_data);
		if(ret == SUCCESS)
			PRINTF("set max angle limit successful.\r\n\r\n");
		Delay(1000);
#endif
		
#if WRITE_TEST
    //Change the angle limit of servo ID1 to 0°~300°.
    write_buffer[0] = 0 & 0xff;;
    write_buffer[1] = (0 >> 8) & 0xff;
    write_buffer[2] = 3000 & 0xff;
    write_buffer[3] = (3000 >> 8) & 0xff;
		primary_servo_write(1, 0x0B, 4, write_buffer, order_buffer, &order_len);
		USART1_Send(order_buffer, order_len);

		USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    receive_len = 0x00;
		Delay(10);
		USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

